; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-5-8-19)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	p0-7 - location
	p1-3 - location
	p1-4 - location
	p3-0 - location
	p3-4 - location
	p4-0 - location
	p4-5 - location
	p5-2 - location
	p5-7 - location
	p6-1 - location
	p6-8 - location
	p7-3 - location
	p8-1 - location
	p8-5 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s2)
	(at driver3 s0)
	(at driver4 s8)
	(at driver5 s8)
	(at truck1 s8)
	(empty truck1)
	(at truck2 s4)
	(empty truck2)
	(at truck3 s3)
	(empty truck3)
	(at truck4 s8)
	(empty truck4)
	(at truck5 s4)
	(empty truck5)
	(at truck6 s3)
	(empty truck6)
	(at truck7 s4)
	(empty truck7)
	(at truck8 s2)
	(empty truck8)
	(at package1 s3)
	(at package2 s1)
	(at package3 s3)
	(at package4 s6)
	(at package5 s3)
	(at package6 s6)
	(at package7 s4)
	(at package8 s8)
	(at package9 s1)
	(at package10 s8)
	(at package11 s3)
	(at package12 s6)
	(at package13 s1)
	(at package14 s6)
	(at package15 s3)
	(at package16 s2)
	(at package17 s4)
	(at package18 s5)
	(at package19 s4)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-0)
	(path p4-0 s4)
	(path s0 p4-0)
	(path p4-0 s0)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(path s6 p6-1)
	(path p6-1 s6)
	(path s1 p6-1)
	(path p6-1 s1)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(path s7 p7-3)
	(path p7-3 s7)
	(path s3 p7-3)
	(path p7-3 s3)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(link s0 s2)
	(link s2 s0)
	(link s0 s5)
	(link s5 s0)
	(link s0 s6)
	(link s6 s0)
	(link s0 s7)
	(link s7 s0)
	(link s1 s3)
	(link s3 s1)
	(link s1 s5)
	(link s5 s1)
	(link s2 s1)
	(link s1 s2)
	(link s2 s4)
	(link s4 s2)
	(link s2 s7)
	(link s7 s2)
	(link s2 s8)
	(link s8 s2)
	(link s3 s0)
	(link s0 s3)
	(link s3 s2)
	(link s2 s3)
	(link s3 s4)
	(link s4 s3)
	(link s3 s5)
	(link s5 s3)
	(link s3 s7)
	(link s7 s3)
	(link s4 s5)
	(link s5 s4)
	(link s6 s8)
	(link s8 s6)
	(link s8 s0)
	(link s0 s8)
	(link s8 s1)
	(link s1 s8)
	(link s8 s3)
	(link s3 s8)
	(link s8 s4)
	(link s4 s8)
	(link s8 s5)
	(link s5 s8)
	(link s8 s7)
	(link s7 s8)
)
	(:goal (and
	(at driver2 s5)
	(at driver4 s0)
	(at truck1 s2)
	(at truck2 s0)
	(at truck3 s1)
	(at truck4 s3)
	(at truck5 s7)
	(at truck7 s0)
	(at truck8 s1)
	(at package1 s0)
	(at package2 s8)
	(at package3 s8)
	(at package4 s3)
	(at package5 s7)
	(at package6 s6)
	(at package7 s2)
	(at package8 s5)
	(at package9 s0)
	(at package10 s3)
	(at package11 s6)
	(at package12 s8)
	(at package13 s2)
	(at package14 s0)
	(at package15 s3)
	(at package16 s1)
	(at package17 s5)
	(at package18 s5)
	(at package19 s6)
	))


)

; plan
1. (board-truck driver2 s2 truck8)
   deleted: (at driver2 s2) (empty truck8)
   added: (driving driver2 truck8)
   goals met: 3 of 28
2. (board-truck driver4 s8 truck1)
   deleted: (at driver4 s8) (empty truck1)
   added: (driving driver4 truck1)
   goals met: 3 of 28
3. (board-truck driver5 s8 truck4)
   deleted: (at driver5 s8) (empty truck4)
   added: (driving driver5 truck4)
   goals met: 3 of 28
4. (drive-truck driver5 s8 s3 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s3)
   goals met: 4 of 28
5. (load-truck s8 package8 truck1)
   deleted: (at package8 s8)
   added: (in package8 truck1)
   goals met: 4 of 28
6. (drive-truck driver4 s8 s4 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s4)
   goals met: 4 of 28
7. (load-truck s4 package7 truck1)
   deleted: (at package7 s4)
   added: (in package7 truck1)
   goals met: 4 of 28
8. (load-truck s4 package19 truck1)
   deleted: (at package19 s4)
   added: (in package19 truck1)
   goals met: 4 of 28
9. (drive-truck driver4 s4 s8 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s8)
   goals met: 4 of 28
10. (load-truck s8 package10 truck1)
   deleted: (at package10 s8)
   added: (in package10 truck1)
   goals met: 4 of 28
11. (drive-truck driver4 s8 s0 truck1)
   deleted: (at truck1 s8)
   added: (at truck1 s0)
   goals met: 4 of 28
12. (load-truck s3 package5 truck4)
   deleted: (at package5 s3)
   added: (in package5 truck4)
   goals met: 4 of 28
13. (load-truck s3 package3 truck4)
   deleted: (at package3 s3)
   added: (in package3 truck4)
   goals met: 4 of 28
14. (load-truck s3 package11 truck4)
   deleted: (at package11 s3)
   added: (in package11 truck4)
   goals met: 4 of 28
15. (load-truck s3 package1 truck4)
   deleted: (at package1 s3)
   added: (in package1 truck4)
   goals met: 4 of 28
16. (drive-truck driver2 s2 s1 truck8)
   deleted: (at truck8 s2)
   added: (at truck8 s1)
   goals met: 5 of 28
17. (walk driver1 s0 p4-0)
   deleted: (at driver1 s0)
   added: (at driver1 p4-0)
   goals met: 5 of 28
18. (walk driver1 p4-0 s4)
   deleted: (at driver1 p4-0)
   added: (at driver1 s4)
   goals met: 5 of 28
19. (load-truck s4 package17 truck2)
   deleted: (at package17 s4)
   added: (in package17 truck2)
   goals met: 5 of 28
20. (load-truck s1 package9 truck8)
   deleted: (at package9 s1)
   added: (in package9 truck8)
   goals met: 5 of 28
21. (load-truck s1 package2 truck8)
   deleted: (at package2 s1)
   added: (in package2 truck8)
   goals met: 5 of 28
22. (load-truck s1 package13 truck8)
   deleted: (at package13 s1)
   added: (in package13 truck8)
   goals met: 5 of 28
23. (drive-truck driver2 s1 s2 truck8)
   deleted: (at truck8 s1)
   added: (at truck8 s2)
   goals met: 4 of 28
24. (load-truck s2 package16 truck8)
   deleted: (at package16 s2)
   added: (in package16 truck8)
   goals met: 4 of 28
25. (drive-truck driver2 s2 s1 truck8)
   deleted: (at truck8 s2)
   added: (at truck8 s1)
   goals met: 5 of 28
26. (unload-truck s1 package16 truck8)
   deleted: (in package16 truck8)
   added: (at package16 s1)
   goals met: 6 of 28
27. (drive-truck driver2 s1 s8 truck8)
   deleted: (at truck8 s1)
   added: (at truck8 s8)
   goals met: 5 of 28
28. (unload-truck s8 package2 truck8)
   deleted: (in package2 truck8)
   added: (at package2 s8)
   goals met: 6 of 28
29. (drive-truck driver5 s3 s0 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   goals met: 5 of 28
30. (drive-truck driver5 s0 s6 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s6)
   goals met: 5 of 28
31. (load-truck s6 package4 truck4)
   deleted: (at package4 s6)
   added: (in package4 truck4)
   goals met: 5 of 28
32. (drive-truck driver5 s6 s0 truck4)
   deleted: (at truck4 s6)
   added: (at truck4 s0)
   goals met: 5 of 28
33. (drive-truck driver5 s0 s3 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   goals met: 6 of 28
34. (unload-truck s3 package4 truck4)
   deleted: (in package4 truck4)
   added: (at package4 s3)
   goals met: 7 of 28
35. (drive-truck driver5 s3 s0 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   goals met: 6 of 28
36. (unload-truck s0 package1 truck4)
   deleted: (in package1 truck4)
   added: (at package1 s0)
   goals met: 7 of 28
37. (drive-truck driver5 s0 s3 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   goals met: 8 of 28
38. (drive-truck driver5 s3 s8 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s8)
   goals met: 7 of 28
39. (unload-truck s8 package3 truck4)
   deleted: (in package3 truck4)
   added: (at package3 s8)
   goals met: 8 of 28
40. (drive-truck driver5 s8 s3 truck4)
   deleted: (at truck4 s8)
   added: (at truck4 s3)
   goals met: 9 of 28
41. (drive-truck driver2 s8 s0 truck8)
   deleted: (at truck8 s8)
   added: (at truck8 s0)
   goals met: 9 of 28
42. (unload-truck s0 package9 truck8)
   deleted: (in package9 truck8)
   added: (at package9 s0)
   goals met: 10 of 28
43. (drive-truck driver2 s0 s2 truck8)
   deleted: (at truck8 s0)
   added: (at truck8 s2)
   goals met: 10 of 28
44. (drive-truck driver2 s2 s1 truck8)
   deleted: (at truck8 s2)
   added: (at truck8 s1)
   goals met: 11 of 28
45. (board-truck driver1 s4 truck2)
   deleted: (at driver1 s4) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 11 of 28
46. (drive-truck driver1 s4 s5 truck2)
   deleted: (at truck2 s4)
   added: (at truck2 s5)
   goals met: 11 of 28
47. (unload-truck s5 package17 truck2)
   deleted: (in package17 truck2)
   added: (at package17 s5)
   goals met: 12 of 28
48. (drive-truck driver1 s5 s0 truck2)
   deleted: (at truck2 s5)
   added: (at truck2 s0)
   goals met: 13 of 28
49. (walk driver3 s0 p4-0)
   deleted: (at driver3 s0)
   added: (at driver3 p4-0)
   goals met: 13 of 28
50. (walk driver3 p4-0 s4)
   deleted: (at driver3 p4-0)
   added: (at driver3 s4)
   goals met: 13 of 28
51. (board-truck driver3 s4 truck5)
   deleted: (at driver3 s4) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 13 of 28
52. (drive-truck driver3 s4 s8 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s8)
   goals met: 13 of 28
53. (drive-truck driver3 s8 s7 truck5)
   deleted: (at truck5 s8)
   added: (at truck5 s7)
   goals met: 14 of 28
54. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 15 of 28
55. (drive-truck driver1 s0 s6 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   goals met: 14 of 28
56. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 13 of 28
57. (load-truck s6 package14 truck2)
   deleted: (at package14 s6)
   added: (in package14 truck2)
   goals met: 13 of 28
58. (drive-truck driver1 s6 s0 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   goals met: 14 of 28
59. (unload-truck s0 package14 truck2)
   deleted: (in package14 truck2)
   added: (at package14 s0)
   goals met: 15 of 28
60. (drive-truck driver4 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 16 of 28
61. (unload-truck s2 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s2)
   goals met: 17 of 28
62. (drive-truck driver4 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 16 of 28
63. (drive-truck driver4 s0 s3 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s3)
   goals met: 16 of 28
64. (unload-truck s3 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s3)
   goals met: 17 of 28
65. (drive-truck driver4 s3 s0 truck1)
   deleted: (at truck1 s3)
   added: (at truck1 s0)
   goals met: 17 of 28
66. (drive-truck driver4 s0 s6 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s6)
   goals met: 17 of 28
67. (unload-truck s6 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s6)
   goals met: 18 of 28
68. (drive-truck driver4 s6 s0 truck1)
   deleted: (at truck1 s6)
   added: (at truck1 s0)
   goals met: 18 of 28
69. (drive-truck driver4 s0 s5 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s5)
   goals met: 18 of 28
70. (unload-truck s5 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s5)
   goals met: 19 of 28
71. (drive-truck driver4 s5 s0 truck1)
   deleted: (at truck1 s5)
   added: (at truck1 s0)
   goals met: 19 of 28
72. (disembark-truck driver4 s0 truck1)
   deleted: (driving driver4 truck1)
   added: (at driver4 s0) (empty truck1)
   goals met: 20 of 28
73. (drive-truck driver1 s0 s6 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   goals met: 19 of 28
74. (load-truck s6 package12 truck2)
   deleted: (at package12 s6)
   added: (in package12 truck2)
   goals met: 19 of 28
75. (drive-truck driver1 s6 s0 truck2)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   goals met: 20 of 28
76. (drive-truck driver1 s0 s8 truck2)
   deleted: (at truck2 s0)
   added: (at truck2 s8)
   goals met: 19 of 28
77. (unload-truck s8 package12 truck2)
   deleted: (in package12 truck2)
   added: (at package12 s8)
   goals met: 20 of 28
78. (drive-truck driver1 s8 s0 truck2)
   deleted: (at truck2 s8)
   added: (at truck2 s0)
   goals met: 21 of 28
79. (drive-truck driver5 s3 s7 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s7)
   goals met: 20 of 28
80. (unload-truck s7 package5 truck4)
   deleted: (in package5 truck4)
   added: (at package5 s7)
   goals met: 21 of 28
81. (drive-truck driver5 s7 s3 truck4)
   deleted: (at truck4 s7)
   added: (at truck4 s3)
   goals met: 22 of 28
82. (disembark-truck driver5 s3 truck4)
   deleted: (driving driver5 truck4)
   added: (at driver5 s3) (empty truck4)
   goals met: 22 of 28
83. (board-truck driver5 s3 truck3)
   deleted: (at driver5 s3) (empty truck3)
   added: (driving driver5 truck3)
   goals met: 22 of 28
84. (unload-truck s3 package11 truck4)
   deleted: (in package11 truck4)
   added: (at package11 s3)
   goals met: 22 of 28
85. (load-truck s3 package11 truck3)
   deleted: (at package11 s3)
   added: (in package11 truck3)
   goals met: 22 of 28
86. (drive-truck driver5 s3 s1 truck3)
   deleted: (at truck3 s3)
   added: (at truck3 s1)
   goals met: 23 of 28
87. (drive-truck driver5 s1 s8 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s8)
   goals met: 22 of 28
88. (drive-truck driver5 s8 s6 truck3)
   deleted: (at truck3 s8)
   added: (at truck3 s6)
   goals met: 22 of 28
89. (unload-truck s6 package11 truck3)
   deleted: (in package11 truck3)
   added: (at package11 s6)
   goals met: 23 of 28
90. (drive-truck driver5 s6 s8 truck3)
   deleted: (at truck3 s6)
   added: (at truck3 s8)
   goals met: 23 of 28
91. (drive-truck driver5 s8 s1 truck3)
   deleted: (at truck3 s8)
   added: (at truck3 s1)
   goals met: 24 of 28
92. (drive-truck driver2 s1 s2 truck8)
   deleted: (at truck8 s1)
   added: (at truck8 s2)
   goals met: 23 of 28
93. (unload-truck s2 package13 truck8)
   deleted: (in package13 truck8)
   added: (at package13 s2)
   goals met: 24 of 28
94. (drive-truck driver2 s2 s1 truck8)
   deleted: (at truck8 s2)
   added: (at truck8 s1)
   goals met: 25 of 28
95. (walk driver4 s0 p4-0)
   deleted: (at driver4 s0)
   added: (at driver4 p4-0)
   goals met: 24 of 28
96. (walk driver4 p4-0 s4)
   deleted: (at driver4 p4-0)
   added: (at driver4 s4)
   goals met: 24 of 28
97. (disembark-truck driver1 s0 truck2)
   deleted: (driving driver1 truck2)
   added: (at driver1 s0) (empty truck2)
   goals met: 24 of 28
98. (board-truck driver1 s0 truck1)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 24 of 28
99. (drive-truck driver1 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 25 of 28
100. (drive-truck driver2 s1 s5 truck8)
   deleted: (at truck8 s1)
   added: (at truck8 s5)
   goals met: 24 of 28
101. (disembark-truck driver2 s5 truck8)
   deleted: (driving driver2 truck8)
   added: (at driver2 s5) (empty truck8)
   goals met: 25 of 28
102. (walk driver4 s4 p4-0)
   deleted: (at driver4 s4)
   added: (at driver4 p4-0)
   goals met: 25 of 28
103. (walk driver4 p4-0 s0)
   deleted: (at driver4 p4-0)
   added: (at driver4 s0)
   goals met: 26 of 28
104. (walk driver2 s5 p4-5)
   deleted: (at driver2 s5)
   added: (at driver2 p4-5)
   goals met: 25 of 28
105. (walk driver2 p4-5 s4)
   deleted: (at driver2 p4-5)
   added: (at driver2 s4)
   goals met: 25 of 28
106. (drive-truck driver5 s1 s5 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   goals met: 24 of 28
107. (disembark-truck driver5 s5 truck3)
   deleted: (driving driver5 truck3)
   added: (at driver5 s5) (empty truck3)
   goals met: 24 of 28
108. (board-truck driver5 s5 truck8)
   deleted: (at driver5 s5) (empty truck8)
   added: (driving driver5 truck8)
   goals met: 24 of 28
109. (drive-truck driver5 s5 s1 truck8)
   deleted: (at truck8 s5)
   added: (at truck8 s1)
   goals met: 25 of 28
110. (walk driver2 s4 p4-5)
   deleted: (at driver2 s4)
   added: (at driver2 p4-5)
   goals met: 25 of 28
111. (walk driver2 p4-5 s5)
   deleted: (at driver2 p4-5)
   added: (at driver2 s5)
   goals met: 26 of 28
112. (board-truck driver2 s5 truck3)
   deleted: (at driver2 s5) (empty truck3)
   added: (driving driver2 truck3)
   goals met: 25 of 28
113. (drive-truck driver2 s5 s1 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s1)
   goals met: 26 of 28
114. (drive-truck driver1 s2 s4 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s4)
   goals met: 25 of 28
115. (disembark-truck driver1 s4 truck1)
   deleted: (driving driver1 truck1)
   added: (at driver1 s4) (empty truck1)
   goals met: 25 of 28
116. (board-truck driver1 s4 truck7)
   deleted: (at driver1 s4) (empty truck7)
   added: (driving driver1 truck7)
   goals met: 25 of 28
117. (drive-truck driver1 s4 s8 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s8)
   goals met: 25 of 28
118. (drive-truck driver2 s1 s5 truck3)
   deleted: (at truck3 s1)
   added: (at truck3 s5)
   goals met: 24 of 28
119. (drive-truck driver2 s5 s4 truck3)
   deleted: (at truck3 s5)
   added: (at truck3 s4)
   goals met: 24 of 28
120. (disembark-truck driver2 s4 truck3)
   deleted: (driving driver2 truck3)
   added: (at driver2 s4) (empty truck3)
   goals met: 24 of 28
121. (board-truck driver2 s4 truck1)
   deleted: (at driver2 s4) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 24 of 28
122. (drive-truck driver2 s4 s2 truck1)
   deleted: (at truck1 s4)
   added: (at truck1 s2)
   goals met: 25 of 28
123. (disembark-truck driver2 s2 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s2) (empty truck1)
   goals met: 25 of 28
124. (drive-truck driver1 s8 s4 truck7)
   deleted: (at truck7 s8)
   added: (at truck7 s4)
   goals met: 25 of 28
125. (walk driver2 s2 p5-2)
   deleted: (at driver2 s2)
   added: (at driver2 p5-2)
   goals met: 25 of 28
126. (walk driver2 p5-2 s5)
   deleted: (at driver2 p5-2)
   added: (at driver2 s5)
   goals met: 26 of 28
127. (disembark-truck driver1 s4 truck7)
   deleted: (driving driver1 truck7)
   added: (at driver1 s4) (empty truck7)
   goals met: 26 of 28
128. (board-truck driver1 s4 truck3)
   deleted: (at driver1 s4) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 26 of 28
129. (drive-truck driver1 s4 s8 truck3)
   deleted: (at truck3 s4)
   added: (at truck3 s8)
   goals met: 26 of 28
130. (drive-truck driver1 s8 s1 truck3)
   deleted: (at truck3 s8)
   added: (at truck3 s1)
   goals met: 27 of 28
131. (walk driver4 s0 p4-0)
   deleted: (at driver4 s0)
   added: (at driver4 p4-0)
   goals met: 26 of 28
132. (walk driver4 p4-0 s4)
   deleted: (at driver4 p4-0)
   added: (at driver4 s4)
   goals met: 26 of 28
133. (board-truck driver4 s4 truck7)
   deleted: (at driver4 s4) (empty truck7)
   added: (driving driver4 truck7)
   goals met: 26 of 28
134. (drive-truck driver4 s4 s8 truck7)
   deleted: (at truck7 s4)
   added: (at truck7 s8)
   goals met: 26 of 28
135. (drive-truck driver4 s8 s0 truck7)
   deleted: (at truck7 s8)
   added: (at truck7 s0)
   goals met: 27 of 28
136. (disembark-truck driver4 s0 truck7)
   deleted: (driving driver4 truck7)
   added: (at driver4 s0) (empty truck7)
   goals met: 28 of 28
